In [2]:
import numpy as np
import pandas as pd

In [3]:
pd.__version__

'0.25.1'

In [6]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [13]:
print(obj.index)
print(obj.values)
print(obj.dtype)
print(obj.size)
print(obj.shape)

RangeIndex(start=0, stop=4, step=1)
[ 4  7 -5  3]
int64
4
(4,)

In [19]:
grade = pd.Series([90, 80, 100, 55, 70],index=['국어','수학','영어','과학','역사'])
grade.name = '중간고사 성적표'
grade.index.name = '과목'
print(grade)
print('평균 :', grade.mean())

과목
국어     90
수학     80
영어    100
과학     55
역사     70
Name: 중간고사 성적표, dtype: int64
평균 : 79.0

In [20]:
grade = pd.Series({'국어':90,'수학':80,'영어':100,'과학':55,'역사':70})
grade.name = '중간고사 성적표'
grade.index.name = '과목'
print(grade)
print('평균 :', grade.mean())

과목
국어     90
수학     80
영어    100
과학     55
역사     70
Name: 중간고사 성적표, dtype: int64
평균 : 79.0

In [37]:
myindex = pd.Series(np.random.randint(100, 200, size=7), index=['one','two','three','four','five','six','seven'])
myindex.name = '[ 100~201 Random Num Series ]'
myindex.index.name = 'index'
print(myindex)
print('Total :', myindex.sum())
print(f'Average : {myindex.mean():.3f}')

index
one      118
two      184
three    195
four     114
five     131
six      105
seven    129
Name: [ 100~201 Random Num Series ], dtype: int32
Total : 976
Average : 139.429

In [77]:
data = {   "name":['Elise', 'Julia', 'Jhon', 'Charles', 'Charles'],
           "year":[2014, 2015, 2016, 2017, 2018],
           "points":[1.5, 1.7, 3.6, 2.5, 2.9]}
data
data['name']
data['points']
# 딕셔너리 리스트의 키값이 컬럼명으로 지정된다. 
df = pd.DataFrame(data)
df
pop =  {'Nevada':{2001:2.4, 2002:2.9},
        'Ohio':{2000:1.5, 2001:1.7, 2002:3.6} } # 빌 경우 NaN
pop
pop['Nevada']
df = pd.DataFrame(pop)
df['Nevada'][:]
df.iloc[0,1:2]
df.loc[2000]
df[:]

Ohio    1.7
Name: 2001, dtype: float64

In [90]:
data = { 
        "Math" : [100,45,89,40],
        "Eng" : [80, 95, 88, 77],
        "Sci" : [100,77 ,89 ,100],
        "Kor" : [50, 50, 50, 50],
        "Music" : [100,45 ,60 ,79 ],
        }
df = pd.DataFrame(data, index=['Jullia','Maria','Jhon','Tome'])
df['Total'] = df['Math'] + df['Eng']+df['Sci']+df['Kor']+df['Music']
df['Avg'] = df['Total']/5
df['Pass'] = df['Avg'] > 70
df

        Math  Eng  Sci  Kor  Music  Total   Avg   Pass
Jullia   100   80  100   50    100    430  86.0   True
Maria     45   95   77   50     45    312  62.4  False
Jhon      89   88   89   50     60    376  75.2   True
Tome      40   77  100   50     79    346  69.2  False

In [91]:
data = {"name":['Elise', 'Julia', 'Jhon', 'Charles', 'Charles'],
       "year":[2014, 2015, 2016, 2017, 2018],
       "points":[1.5, 1.7, 3.6, 2.5, 2.9],
       "penalty": np.arange(1,6)}
df = pd.DataFrame(data, columns=["year","name","points","penalty"],
                 index=["one", "two", "three", "four", "five"])

In [95]:
df

       year     name  points  penalty
one    2014    Elise     1.5        1
two    2015    Julia     1.7        2
three  2016     Jhon     3.6        3
four   2017  Charles     2.5        4
five   2018  Charles     2.9        5

In [120]:
df[1:4]

       year     name  points  penalty
two    2015    Julia     1.7        2
three  2016     Jhon     3.6        3
four   2017  Charles     2.5        4

In [117]:
df.iloc[1:4,[0,2]]

       year  points
two    2015     1.7
three  2016     3.6
four   2017     2.5

In [115]:
df.loc['two' : 'four', ['year','points']]

       year  points
two    2015     1.7
three  2016     3.6
four   2017     2.5

In [114]:
df[['year','name']]

       year     name
one    2014    Elise
two    2015    Julia
three  2016     Jhon
four   2017  Charles
five   2018  Charles

In [132]:
df

         year     name  points  penalty  bonus
one    2014.0    Elise     1.5      1.0     10
two    2015.0    Julia     1.7      2.0     20
three  2016.0     Jhon     3.6      3.0     30
four   2017.0  Charles     2.5      4.0     40
five   2018.0  Charles     2.9      5.0     50
six    2019.0   hayong     4.0      6.0     60

In [124]:
df.loc['six', :] = [2019, 'hayong', 4.0, 6]

In [129]:
df.loc[:,'bonus']=[10,20,30,40,50,60]

In [131]:
del df['hello']

In [133]:
dfTest = pd.DataFrame(np.random.randint(1,100,size=30).reshape(-1,5),
                     columns=['col1','col2','col3', 'col4', 'col5'],
                     index =['row1','row2','row3', 'row4', 'row5', 'row6'])
dfTest

      col1  col2  col3  col4  col5
row1     1    92    28    12    26
row2    41    14    15    58    21
row3    84     1    45    70    62
row4    54    61    94    34    74
row5     1    45    17    79    11
row6    94    83    16    24    15

In [141]:
dfTest.loc['row1',:]

col1     1
col2    92
col3    28
col4    12
col5    26
Name: row1, dtype: int32

In [136]:
dfTest.loc['row1':'row4',:]

      col1  col2  col3  col4  col5
row1     1    92    28    12    26
row2    41    14    15    58    21
row3    84     1    45    70    62
row4    54    61    94    34    74

In [137]:
dfTest.loc[:,'col5']

row1    26
row2    21
row3    62
row4    74
row5    11
row6    15
Name: col5, dtype: int32

In [138]:
dfTest.loc['row1',['col2','col5']]

col2    92
col5    26
Name: row1, dtype: int32

In [139]:
dfTest.loc[['row5','row6'], 'col3']

row5    17
row6    16
Name: col3, dtype: int32

In [142]:
dfTest

      col1  col2  col3  col4  col5
row1     1    92    28    12    26
row2    41    14    15    58    21
row3    84     1    45    70    62
row4    54    61    94    34    74
row5     1    45    17    79    11
row6    94    83    16    24    15

In [147]:
dfTest.drop(index=['row2'])

      col1  col2  col3  col4  col5
row3    84     1    45    70    62
row4    54    61    94    34    74
row5     1    45    17    79    11
row6    94    83    16    24    15

In [148]:
dfTest

      col1  col2  col3  col4  col5
row2    41    14    15    58    21
row3    84     1    45    70    62
row4    54    61    94    34    74
row5     1    45    17    79    11
row6    94    83    16    24    15

In [ ]:
dfTest.drop(columns = ['col5'], inplace=True)

In [149]:
dfTest.drop(index=['row5'], inplace=True)

In [150]:
dfTest

      col1  col2  col3  col4  col5
row2    41    14    15    58    21
row3    84     1    45    70    62
row4    54    61    94    34    74
row6    94    83    16    24    15

In [162]:
data = [[1.4, np.nan],
         [7.1, -4.5],
         [np.nan, np.nan],
         [0.75, -1.3]]

In [163]:
df = pd.DataFrame(data, columns=["one","two"], index=["a", "b", "c", "d"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [164]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [165]:
df.sum(axis =0)

one    9.25
two   -5.80
dtype: float64

In [166]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [174]:
df.loc['b'].sum()

2.5999999999999996

In [179]:
data = [[1.4, np.nan],
         [7.1, -4.5],
         [np.nan, np.nan],
         [0.75, -1.3]]
df = pd.DataFrame(data, columns=["one","two"], index=["a", "b", "c", "d"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [180]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [181]:
df.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [182]:
df.sum(axis=0, skipna=False)

one   NaN
two   NaN
dtype: float64

In [186]:
df.mean(axis=0, skipna=True)

one    3.083333
two   -2.900000
dtype: float64

In [184]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [190]:
df.sum(axis=0, skipna=True)

one    9.25
two   -5.80
dtype: float64

In [191]:
df.fillna(value=df.min(axis=0), inplace=False) # NaN 채우기

    one  two
a  1.40 -4.5
b  7.10 -4.5
c  0.75 -4.5
d  0.75 -1.3

In [192]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [193]:
df1 = pd.DataFrame(
    np.arange(31,40).reshape(3,3), 
    columns=list("abc")) # ['a', 'b', 'c']
df2 = pd.DataFrame(
    np.arange(1,17).reshape(4,4), 
    columns=list("abcd"))

In [194]:
df1

    a   b   c
0  31  32  33
1  34  35  36
2  37  38  39

In [195]:
df2

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [196]:
df1+df2

      a     b     c   d
0  32.0  34.0  36.0 NaN
1  39.0  41.0  43.0 NaN
2  46.0  48.0  50.0 NaN
3   NaN   NaN   NaN NaN

In [198]:
df1.add(df2, fill_value=0)

      a     b     c     d
0  32.0  34.0  36.0   4.0
1  39.0  41.0  43.0   8.0
2  46.0  48.0  50.0  12.0
3  13.0  14.0  15.0  16.0

In [199]:
df1-df2

      a     b     c   d
0  30.0  30.0  30.0 NaN
1  29.0  29.0  29.0 NaN
2  28.0  28.0  28.0 NaN
3   NaN   NaN   NaN NaN

In [201]:
df1*df2

       a      b      c   d
0   31.0   64.0   99.0 NaN
1  170.0  210.0  252.0 NaN
2  333.0  380.0  429.0 NaN
3    NaN    NaN    NaN NaN

In [202]:
df1/df2

           a          b          c   d
0  31.000000  16.000000  11.000000 NaN
1   6.800000   5.833333   5.142857 NaN
2   4.111111   3.800000   3.545455 NaN
3        NaN        NaN        NaN NaN

In [204]:
df1

    a   b   c
0  31  32  33
1  34  35  36
2  37  38  39

In [205]:
df1.subtract(df2, fill_value=0)

      a     b     c     d
0  30.0  30.0  30.0  -4.0
1  29.0  29.0  29.0  -8.0
2  28.0  28.0  28.0 -12.0
3 -13.0 -14.0 -15.0 -16.0

In [206]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [207]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [208]:
pd.merge(df1, df2)

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [209]:
pd.merge(df1, df2, how='outer')

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [211]:
pd.merge(df1, df2, how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [212]:
pd.merge(df1, df2, how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1001   둘리   30000
3  1005   희동   15000
4  1006  마이콜    5000
5  1008  NaN  100000

In [225]:
scores = pd.DataFrame({
    '과학' : [100, 77, 77, 100],
    '국사' :  [70, 87, 60, 79 ],
    '국어' :  [100, 78,78, 99],
    '수학' :  [100, 85, 89, 90],
    '영어' :  [80, 95, 88, 77 ]
})
scores.index=['김남준','박지민','민윤기','김태형']

In [226]:
scores

      과학  국사   국어   수학  영어
김남준  100  70  100  100  80
박지민   77  87   78   85  95
민윤기   77  60   78   89  88
김태형  100  79   99   90  77

In [227]:
scores['총합'] = scores['과학'] + scores['국사'] + scores['수학'] + scores['영어'] + scores['국어']

In [263]:
scores['총합'] = scores.sum(axis=1)

In [228]:
scores['평균'] = scores['총합']/5

In [229]:
scores['합격여부'] = scores['평균']>80

In [264]:
scores

      과학  국사   국어   수학  영어     총합    평균   합격여부
김남준  100  70  100  100  80  991.0  90.0   True
박지민   77  87   78   85  95  929.4  84.4   True
민윤기   77  60   78   89  88  862.4  78.4  False
김태형  100  79   99   90  77  980.0  89.0   True

In [213]:
population_A = pd.DataFrame( {'Nation':['중국','인도','미국'],
                              'Population':[1420047, 1368693, 329086],
                               'Percent':[18.54, 17.74, 4.28]  })

population_B = pd.DataFrame( {'Nation':['일본','베트남','터키'],
                              'Population':[126856, 97426, 82959 ],
                               'Percent':[1.67, 1.26, 1.08]  })

In [293]:
a=population_A.T

In [294]:
b=population_B.T

In [298]:
c =pd.concat([a, b], axis=1)
c.columns=[1,2,3,4,5,6]

In [299]:
c

                  1        2       3       4      5      6
Nation           중국       인도      미국      일본    베트남     터키
Population  1420047  1368693  329086  126856  97426  82959
Percent       18.54    17.74    4.28    1.67   1.26   1.08

In [277]:
pd.merge(population_A, population_B, how='outer').T

                  0        1       2       3      4      5
Nation           중국       인도      미국      일본    베트남     터키
Population  1420047  1368693  329086  126856  97426  82959
Percent       18.54    17.74    4.28    1.67   1.26   1.08

In [278]:
pd.concat([population_A, population_B]).T

                  0        1       2       0      1      2
Nation           중국       인도      미국      일본    베트남     터키
Population  1420047  1368693  329086  126856  97426  82959
Percent       18.54    17.74    4.28    1.67   1.26   1.08

In [260]:
group1 = pd.DataFrame({
   '감독'    : ['최강희'  , '황선홍', '김도훈', '최순호', '조성환'],
   '구단명'  : ['전북현대', 'FC서울', '울산현대', '포항스틸러스', '제주유나이티드'],
   '우승횟수': [4,3, 2, 5, 0]
})

group2 = pd.DataFrame({
    'club' : ['전북현대', 'FC서울', '울산현대', '포항스틸러스', '제주유나이티드'],
    '소유주' : ['현대자동차', 'GS그룹', '현대중공업', '포항제철', 'SK에너지'],
    '수용인원' : [42477,66704, 44102, 25000, 29791],
    '홈구장' : ['전주월드컵경기장','서울월드컵경기장','울산문수축구경기장','포항스틸야드','제주월드컵경기장']
})

In [261]:
group1

    감독      구단명  우승횟수
0  최강희     전북현대     4
1  황선홍     FC서울     3
2  김도훈     울산현대     2
3  최순호   포항스틸러스     5
4  조성환  제주유나이티드     0

In [262]:
group2

      club    소유주   수용인원        홈구장
0     전북현대  현대자동차  42477   전주월드컵경기장
1     FC서울   GS그룹  66704   서울월드컵경기장
2     울산현대  현대중공업  44102  울산문수축구경기장
3   포항스틸러스   포항제철  25000     포항스틸야드
4  제주유나이티드  SK에너지  29791   제주월드컵경기장

In [265]:
pd.merge(group1, group2, left_on='구단명', right_on='club')

    감독      구단명  우승횟수     club    소유주   수용인원        홈구장
0  최강희     전북현대     4     전북현대  현대자동차  42477   전주월드컵경기장
1  황선홍     FC서울     3     FC서울   GS그룹  66704   서울월드컵경기장
2  김도훈     울산현대     2     울산현대  현대중공업  44102  울산문수축구경기장
3  최순호   포항스틸러스     5   포항스틸러스   포항제철  25000     포항스틸야드
4  조성환  제주유나이티드     0  제주유나이티드  SK에너지  29791   제주월드컵경기장

In [303]:
group1

    감독      구단명  우승횟수
0  최강희     전북현대     4
1  황선홍     FC서울     3
2  김도훈     울산현대     2
3  최순호   포항스틸러스     5
4  조성환  제주유나이티드     0

In [304]:
group2

      club    소유주   수용인원        홈구장
0     전북현대  현대자동차  42477   전주월드컵경기장
1     FC서울   GS그룹  66704   서울월드컵경기장
2     울산현대  현대중공업  44102  울산문수축구경기장
3   포항스틸러스   포항제철  25000     포항스틸야드
4  제주유나이티드  SK에너지  29791   제주월드컵경기장

In [305]:
group1['club'] = group1['구단명']

In [306]:
pd.merge(group1, group2)

    감독      구단명  우승횟수     club    소유주   수용인원        홈구장
0  최강희     전북현대     4     전북현대  현대자동차  42477   전주월드컵경기장
1  황선홍     FC서울     3     FC서울   GS그룹  66704   서울월드컵경기장
2  김도훈     울산현대     2     울산현대  현대중공업  44102  울산문수축구경기장
3  최순호   포항스틸러스     5   포항스틸러스   포항제철  25000     포항스틸야드
4  조성환  제주유나이티드     0  제주유나이티드  SK에너지  29791   제주월드컵경기장

<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>